backend/artillery-chat-test.yml
config:
  target: 'ws://i13a403.p.ssafy.io:8084'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up - 기본 연결 테스트"
    - duration: 60
      arrivalRate: 10
      name: "Low Load - 저부하 테스트"
    - duration: 60
      arrivalRate: 20
      name: "Medium Load - 중부하 테스트"
    - duration: 30
      arrivalRate: 50
      name: "High Load - 고부하 테스트"
  ws:
    connect:
      timeout: 10

scenarios:
  - name: "직관 채팅 테스트 (Redis Pub/Sub)"
    weight: 50
    engine: ws
    flow:
      - connect:
          url: "/ws/chat?sessionToken=test-watch-token-{{ $randomString() }}&roomType=watch&roomId=watch_{{ $randomInt(1, 5) }}"
      - think: 1
      - send: 
          payload: '{"type":"CHAT","content":"직관 메시지 {{ $randomString() }}"}'
      - think: 2
      - send:
          payload: '{"type":"CHAT","content":"응원합니다! {{ counter }}"}'
      - think: 3
      - send:
          payload: '{"type":"CHAT","content":"화이팅! 시간: {{ $timestamp }}"}'
      - think: 1

  - name: "매칭 채팅 테스트 (Kafka)"
    weight: 50
    engine: ws 
    flow:
      - connect:
          url: "/ws/chat?sessionToken=test-match-token-{{ $randomString() }}&roomType=match&roomId=match_{{ $randomInt(1, 3) }}"
      - think: 1
      - send:
          payload: '{"type":"CHAT","content":"매칭 메시지 {{ $randomString() }}"}'
      - think: 3
      - send:
          payload: '{"type":"CHAT","content":"같이 게임해요~ {{ counter }}"}'
      - think: 2
      - send:
          payload: '{"type":"CHAT","content":"GG! 시간: {{ $timestamp }}"}'
      - think: 2