backend/artillery-high-performance-test.yml
config:
  target: 'ws://localhost:8084'
  phases:
    - duration: 30
      arrivalRate: 20
      name: "🔥 고성능 테스트 1단계"
    - duration: 60
      arrivalRate: 50
      name: "⚡ 고성능 테스트 2단계"
    - duration: 60
      arrivalRate: 100
      name: "🚀 고성능 테스트 3단계"
    - duration: 30
      arrivalRate: 200
      name: "💥 극한 성능 테스트"
  ws:
    connect:
      timeout: 15

scenarios:
  - name: "직관 채팅 고부하 테스트"
    weight: 60
    engine: ws
    flow:
      - connect:
          url: "/ws/watch-chat?sessionToken=test-watch-{{ $randomString() }}&gameId={{ $randomInt(1, 5) }}&teamId={{ $randomInt(1, 6) }}"
      - think: 0.5
      - send: 
          payload: '⚽ 골!!! {{ $randomString() }}'
      - think: 1
      - send:
          payload: '🔥 좋은 플레이!'
      - think: 0.5
      - send:
          payload: '화이팅! {{ counter }}'

  - name: "매칭 채팅 고부하 테스트"
    weight: 40
    engine: ws
    flow:
      - connect:
          url: "/ws/match-chat?sessionToken=test-match-{{ $randomString() }}&matchId=match_{{ $randomInt(1, 10) }}"
      - think: 0.5
      - send: 
          payload: 'GG! {{ $randomString() }}'
      - think: 1
      - send:
          payload: '같이 게임해요~'
      - think: 0.5
      - send:
          payload: '잘 부탁드립니다! {{ $timestamp }}'