backend/artillery-match-chat.yml
config:
  target: 'ws://i13a403.p.ssafy.io:8084'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "매칭 채팅 Warm up"
    - duration: 60
      arrivalRate: 10
      name: "매칭 채팅 Load Test"
    - duration: 30
      arrivalRate: 20
      name: "매칭 채팅 Stress Test"
  ws:
    connect:
      timeout: 15

scenarios:
  - name: "매칭 채팅 시나리오 (Kafka)"
    engine: ws
    flow:
      - connect:
          url: "/ws/match-chat?sessionToken=match-token-{{ $randomString() }}"
      - think: 1
      - send: 
          payload: '{"type":"CHAT","content":"안녕하세요! {{ $randomString() }}"}'
      - think: 2
      - send:
          payload: '{"type":"CHAT","content":"같이 게임해요~"}'
      - think: 1
      - send:
          payload: '{"type":"CHAT","content":"잘 부탁드립니다!"}'
      - think: 3
      - send:
          payload: '{"type":"CHAT","content":"GG! 수고하셨습니다"}'