backend/artillery-test-final.yml
config:
  target: 'ws://i13a403.p.ssafy.io:8084'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "🧪 테스트 모드 Warm up"
    - duration: 60
      arrivalRate: 10
      name: "🔥 저부하 테스트"
    - duration: 30
      arrivalRate: 20
      name: "⚡ 고부하 테스트"
  ws:
    connect:
      timeout: 15

scenarios:
  - name: "직관 채팅 테스트 (Redis Pub/Sub)"
    weight: 50
    engine: ws
    flow:
      - connect:
          url: "/ws/watch-chat?sessionToken=test-watch-{{ $randomString() }}&gameId={{ $randomInt(1, 3) }}&teamId={{ $randomInt(1, 4) }}"
      - think: 1
      - send: 
          payload: '경기 시작! {{ $randomString() }}'
      - think: 2
      - send:
          payload: '좋은 플레이네요!'
      - think: 1
      - send:
          payload: '{{ $randomString() }} 화이팅!'
      - think: 3

  - name: "매칭 채팅 테스트 (Kafka)"
    weight: 50
    engine: ws
    flow:
      - connect:
          url: "/ws/match-chat?sessionToken=test-match-{{ $randomString() }}&matchId=match_{{ $randomInt(1, 3) }}"
      - think: 1
      - send: 
          payload: '안녕하세요! {{ $randomString() }}'
      - think: 2
      - send:
          payload: '같이 게임해요~'
      - think: 1
      - send:
          payload: 'GG! {{ $timestamp }}'
      - think: 3