backend/artillery-watch-chat.yml
config:
  target: 'ws://i13a403.p.ssafy.io:8084'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "직관 채팅 Warm up"
    - duration: 60
      arrivalRate: 15
      name: "직관 채팅 Load Test"
    - duration: 30
      arrivalRate: 30
      name: "직관 채팅 Stress Test"
  ws:
    connect:
      timeout: 15
  variables:
    roomIds:
      - "watch_1"
      - "watch_2" 
      - "watch_3"
      - "watch_4"
      - "watch_5"

scenarios:
  - name: "직관 채팅 시나리오 (Redis Pub/Sub)"
    engine: ws
    flow:
      - connect:
          url: "/ws/chat?sessionToken=watch-token-{{ $randomString() }}&roomType=watch&roomId={{ roomIds[$randomInt(0, 4)] }}"
      - think: 1
      - send: 
          payload: '{"type":"CHAT","content":"경기 시작!"}'
      - think: 2
      - send:
          payload: '{"type":"CHAT","content":"좋은 플레이네요!"}'
      - think: 1
      - send:
          payload: '{"type":"CHAT","content":"화이팅!"}'
      - think: 3
      - send:
          payload: '{"type":"CHAT","content":"GG 잘봤습니다"}'